In [3]:
import pandas as pd
import numpy as np

In [4]:
raw_data = {
    'player_name': ['Russell Westbrook', 'Lebron James', 'Anthony Davis', np.nan, 'Lugentz Dort'],
    'team': ['LAL', 'LAL', 'LAL', np.nan, 'OKC'],
    'gp': [82, 75, 70, np.nan, 72],
    'blocks': [30, 35, 160, np.nan, 40]
}

In [5]:
df = pd.DataFrame(raw_data, columns = ['player_name', 'team', 'gp', 'blocks'])

In [6]:
df

         player_name team    gp  blocks
0  Russell Westbrook  LAL  82.0    30.0
1       Lebron James  LAL  75.0    35.0
2      Anthony Davis  LAL  70.0   160.0
3                NaN  NaN   NaN     NaN
4       Lugentz Dort  OKC  72.0    40.0

In [8]:
# dropping non data value rows with .dropna
# axis -> 0=rows, 1=cols
# -> any for any row with non data value or all for whole row must be non data values
# use subset to check for one specific value only

In [9]:
clean_df = df.dropna(axis=0, how='all')

In [10]:
clean_df

         player_name team    gp  blocks
0  Russell Westbrook  LAL  82.0    30.0
1       Lebron James  LAL  75.0    35.0
2      Anthony Davis  LAL  70.0   160.0
4       Lugentz Dort  OKC  72.0    40.0

In [11]:
# Fill non data values with .fillna

In [12]:
updated_df = df.fillna(0)

In [13]:
updated_df

         player_name team    gp  blocks
0  Russell Westbrook  LAL  82.0    30.0
1       Lebron James  LAL  75.0    35.0
2      Anthony Davis  LAL  70.0   160.0
3                  0    0   0.0     0.0
4       Lugentz Dort  OKC  72.0    40.0